---
type: FileImportedEventArgs
namespace: Autodesk.Revit.DB.Events
version: 2024
members: 3
tags: [revit-api, class]
---

# FileImportedEventArgs

`Autodesk.Revit.DB.Events.FileImportedEventArgs` · Revit 2024 · 3 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Property | Format | 2010 | `public ImportExportFileFormat Format { get ; }` |
| Property | ImportedInstanceId | 2010 | `public ElementId ImportedInstanceId { get ; }` |
| Property | Path | 2010 | `public string Path { get ; }` |